In [1]:
import pandas as pd
import numpy as np

In [5]:
data = pd.Series([0.25, 0.5, 0.75, 1.0],
                index = ["a", "b","c","d"])
data

a    0.25
b    0.50
c    0.75
d    1.00
dtype: float64

In [7]:
data.keys()

Index(['a', 'b', 'c', 'd'], dtype='object')

In [9]:
data["a":"c"]

a    0.25
b    0.50
c    0.75
dtype: float64

In [10]:
data[0:2]

a    0.25
b    0.50
dtype: float64

In [13]:
data= pd.Series(['a','b','c'], index = [1,3,5])
data

1    a
3    b
5    c
dtype: object

In [14]:
data[1]

'a'

In [18]:
data.loc[1]
data.loc[3]

'b'

In [19]:
data.iloc[0:2]

1    a
3    b
dtype: object

In [20]:
area = pd.Series({'California': 423967, 'Texas': 695662,
                  'New York': 141297, 'Florida': 170312,
                  'Illinois': 149995})
pop = pd.Series({'California': 38332521, 'Texas': 26448193,
                 'New York': 19651127, 'Florida': 19552860,
                 'Illinois': 12882135})
data = pd.DataFrame({'area':area, 'pop':pop})
data

              area       pop
California  423967  38332521
Texas       695662  26448193
New York    141297  19651127
Florida     170312  19552860
Illinois    149995  12882135

In [22]:
data['density'] = data['pop']/data['area']
data

              area       pop     density
California  423967  38332521   90.413926
Texas       695662  26448193   38.018740
New York    141297  19651127  139.076746
Florida     170312  19552860  114.806121
Illinois    149995  12882135   85.883763

In [23]:
data.values

array([[4.23967000e+05, 3.83325210e+07, 9.04139261e+01],
       [6.95662000e+05, 2.64481930e+07, 3.80187404e+01],
       [1.41297000e+05, 1.96511270e+07, 1.39076746e+02],
       [1.70312000e+05, 1.95528600e+07, 1.14806121e+02],
       [1.49995000e+05, 1.28821350e+07, 8.58837628e+01]])

In [24]:
data.T

           California         Texas      New York       Florida      Illinois
area     4.239670e+05  6.956620e+05  1.412970e+05  1.703120e+05  1.499950e+05
pop      3.833252e+07  2.644819e+07  1.965113e+07  1.955286e+07  1.288214e+07
density  9.041393e+01  3.801874e+01  1.390767e+02  1.148061e+02  8.588376e+01

In [28]:
 data.iloc[0, 1]

38332521

In [33]:
data[1:2]

         area       pop   density
Texas  695662  26448193  38.01874

In [39]:
rng = np.random.RandomState(42)
ser = pd.Series(rng.randint(0, 10 ,4))
ser

0    6
1    3
2    7
3    4
dtype: int32

In [40]:
df = pd.DataFrame(rng.randint(0, 10, (3 ,4)),
                 columns = ['A', 'B', 'C','D'])
df

   A  B  C  D
0  6  9  2  6
1  7  4  3  7
2  7  2  5  4

In [41]:
np.exp(ser)

0     403.428793
1      20.085537
2    1096.633158
3      54.598150
dtype: float64

In [42]:
A = pd.DataFrame(rng.randint(0, 20, (2, 2)),
                 columns=list('AB'))
A.stack().mean()

4.5